// ============================================================
// 函数名称: memcpy
// 虚拟地址: 0x41a3f0
// WARP GUID: 97e20386-daf0-5cb1-a189-102b0df63745
// 源二进制: E:/torrent/Cursor/SkskShogi-1.022-win/SkskShogi.exe.bndb
// ------------------------------------------------------------
// [交叉引用字符串]: 无
// [外部 API 调用]: 无
// [内部子函数调用]: 无
// [被调用的父级函数]: sub_401ae0, sub_403b20, sub_404040, sub_401990, sub_403be0, sub_401d60, sub_401c80, sub_403740, sub_4013b0
// ============================================================

int32_tmemcpy()
{
    // 第一条实际指令: return memcpy() __tailcall
    return memcpy() __tailcall
}
