// ============================================================
// 函数名称: _start
// 虚拟地址: 0x419e0b
// WARP GUID: b1a582c1-804e-56b2-8441-7954b0400130
// 源二进制: E:/torrent/Cursor/SkskShogi-1.022-win/SkskShogi.exe.bndb
// ------------------------------------------------------------
// [交叉引用字符串]: 无
// [外部 API 调用]: 无
// [内部子函数调用]: ___security_init_cookie, sub_419c5e
// [被调用的父级函数]: 无
// ============================================================

int32_t_start()
{
    // 第一条实际指令: ___security_init_cookie()
    ___security_init_cookie()
    return sub_419c5e() __tailcall
}
