// ============================================================
// 函数名称: sub_410ca0
// 虚拟地址: 0x410ca0
// WARP GUID: 90a46e73-11f1-5ecf-b832-50d5e4dc98b2
// 源二进制: E:/torrent/Cursor/SkskShogi-1.022-win/SkskShogi.exe.bndb
// ------------------------------------------------------------
// [交叉引用字符串]: 无
// [外部 API 调用]: 无
// [内部子函数调用]: sub_4106b0
// [被调用的父级函数]: 无
// ============================================================

int32_t __fastcallsub_410ca0(void* arg1)
{
    // 第一条实际指令: return sub_4106b0(arg1 + 4) __tailcall
    return sub_4106b0(arg1 + 4) __tailcall
}
