// ============================================================
// 函数名称: sub_419dbb
// 虚拟地址: 0x419dbb
// WARP GUID: 71190b5e-cfd8-5437-8d24-588ca1d67f00
// 源二进制: E:/torrent/Cursor/SkskShogi-1.022-win/SkskShogi.exe.bndb
// ------------------------------------------------------------
// [交叉引用字符串]: 无
// [外部 API 调用]: _XcptFilter
// [内部子函数调用]: 无
// [被调用的父级函数]: 无
// ============================================================

int32_tsub_419dbb(void* arg1 @ ebp)
{
    // 第一条实际指令: int32_t* ecx_1 = *(arg1 - 0x14)
    int32_t* ecx_1 = *(arg1 - 0x14)
    int32_t eax_1 = **ecx_1
    *(arg1 - 0x24) = eax_1
    return _XcptFilter(eax_1, ecx_1)
}
