// ============================================================
// 函数名称: sub_401ab0
// 虚拟地址: 0x401ab0
// WARP GUID: 5c044034-cfa2-5407-92ca-f7daedfbaa6d
// 源二进制: E:/torrent/Cursor/SkskShogi-1.022-win/SkskShogi.exe.bndb
// ------------------------------------------------------------
// [交叉引用字符串]: 无
// [外部 API 调用]: 无
// [内部子函数调用]: 无
// [被调用的父级函数]: sub_404040, sub_404140, sub_404680
// ============================================================

void __thiscallsub_401ab0(int32_t* arg1, int32_t arg2)
{
    // 第一条实际指令: bool cond:0 = arg1[5] u< 0x10
    bool cond:0 = arg1[5] u< 0x10
    arg1[4] = arg2
    
    if (cond:0)
        *(arg1 + arg2) = 0
        return 
    
    (*arg1)[arg2] = 0
}
