// ============================================================
// 函数名称: sub_401ee0
// 虚拟地址: 0x401ee0
// WARP GUID: 00089b6f-b184-52dd-bcb1-1e703c9f949b
// 源二进制: E:/torrent/Cursor/SkskShogi-1.022-win/SkskShogi.exe.bndb
// ------------------------------------------------------------
// [交叉引用字符串]: 无
// [外部 API 调用]: 无
// [内部子函数调用]: 无
// [被调用的父级函数]: sub_401280, sub_401050, sub_41c450, sub_41c4b0
// ============================================================

int32_tsub_401ee0() __pure
{
    // 第一条实际指令: return 
    return 
}
