// ============================================================
// 函数名称: sub_40f2d0
// 虚拟地址: 0x40f2d0
// WARP GUID: 0b39167b-1839-51d0-aba2-99c40829053d
// 源二进制: E:/torrent/Cursor/SkskShogi-1.022-win/SkskShogi.exe.bndb
// ------------------------------------------------------------
// [交叉引用字符串]: 无
// [外部 API 调用]: 无
// [内部子函数调用]: 无
// [被调用的父级函数]: 无
// ============================================================

void __fastcallsub_40f2d0(void* arg1)
{
    // 第一条实际指令: void* esi = *(arg1 + 4)
    void* esi = *(arg1 + 4)
    int32_t* ecx = *(esi + 0x2b4)
    
    if (ecx != 0)
        (*(*ecx + 0x12c))(1)
        *(esi + 0x2b4) = 0
    
    *(esi + 0x2a0) = 0
}
