// ============================================================
// 函数名称: sub_4165b6
// 虚拟地址: 0x4165b6
// WARP GUID: 6d46d1ab-dc24-506e-bbf2-9812b574d717
// 源二进制: E:/torrent/Cursor/SkskShogi-1.022-win/SkskShogi.exe.bndb
// ------------------------------------------------------------
// [交叉引用字符串]: 无
// [外部 API 调用]: 无
// [内部子函数调用]: sub_411170
// [被调用的父级函数]: 无
// ============================================================

int32_t __fastcallsub_4165b6(int32_t arg1)
{
    // 第一条实际指令: return sub_411170(arg1 - 0x2a0) __tailcall
    return sub_411170(arg1 - 0x2a0) __tailcall
}
