// ============================================================
// 函数名称: sub_41c450
// 虚拟地址: 0x41c450
// WARP GUID: 29c198c3-2ec1-5cc6-a59e-828000cf578d
// 源二进制: E:/torrent/Cursor/SkskShogi-1.022-win/SkskShogi.exe.bndb
// ------------------------------------------------------------
// [交叉引用字符串]: 无
// [外部 API 调用]: 无
// [内部子函数调用]: sub_401ee0, sub_401d30
// [被调用的父级函数]: sub_4011e0
// ============================================================

void __fastcallsub_41c450(int32_t arg1)
{
    // 第一条实际指令: int32_t var_8 = arg1
    int32_t var_8 = arg1
    
    if (data_429094 u>= 0x10)
        void* var_10_1 = &var_8:3
        operator delete(data_429080.d)
    
    data_429094 = 0xf
    data_429090 = 0
    data_429080 = 0
}
