// ============================================================
// 函数名称: sub_410ec0
// 虚拟地址: 0x410ec0
// WARP GUID: ef3f5710-3b52-560b-b3ae-45512fcfd03a
// 源二进制: E:/torrent/Cursor/SkskShogi-1.022-win/SkskShogi.exe.bndb
// ------------------------------------------------------------
// [交叉引用字符串]: 无
// [外部 API 调用]: 无
// [内部子函数调用]: sub_410970
// [被调用的父级函数]: 无
// ============================================================

int32_t __fastcallsub_410ec0(void* arg1)
{
    // 第一条实际指令: return sub_410970(arg1 + 4) __tailcall
    return sub_410970(arg1 + 4) __tailcall
}
