// ============================================================
// 函数名称: sub_40def0
// 虚拟地址: 0x40def0
// WARP GUID: ea02f738-e7ca-517b-8f0c-fd48067abc32
// 源二进制: E:/torrent/Cursor/SkskShogi-1.022-win/SkskShogi.exe.bndb
// ------------------------------------------------------------
// [交叉引用字符串]: 无
// [外部 API 调用]: 无
// [内部子函数调用]: 无
// [被调用的父级函数]: 无
// ============================================================

void* __fastcallsub_40def0(void* arg1)
{
    // 第一条实际指令: (*(**(arg1 + 8) + 0xc))(7)
    (*(**(arg1 + 8) + 0xc))(7)
    int32_t* ecx_1 = *(arg1 + 8)
    int32_t* var_8 = ecx_1
    (*(*ecx_1 + 0xb4))(0)
    void* result = *(arg1 + 4)
    *(result + 0x2bc) -= 1
    return result
}
