// ============================================================
// 函数名称: sub_40e200
// 虚拟地址: 0x40e200
// WARP GUID: 575a414e-2d07-575d-a269-b7d8c9bc7686
// 源二进制: E:/torrent/Cursor/SkskShogi-1.022-win/SkskShogi.exe.bndb
// ------------------------------------------------------------
// [交叉引用字符串]: 无
// [外部 API 调用]: 无
// [内部子函数调用]: 无
// [被调用的父级函数]: 无
// ============================================================

int32_tsub_40e200() __pure
{
    // 第一条实际指令: return &data_429730
    return &data_429730
}
