// ============================================================
// 函数名称: sub_41a400
// 虚拟地址: 0x41a400
// WARP GUID: 1f302d23-cf09-5ef7-84e6-865f4e5013c2
// 源二进制: E:/torrent/Cursor/SkskShogi-1.022-win/SkskShogi.exe.bndb
// ------------------------------------------------------------
// [交叉引用字符串]: 无
// [外部 API 调用]: 无
// [内部子函数调用]: sub_401960
// [被调用的父级函数]: 无
// ============================================================

int32_tsub_41a400(void* arg1 @ ebp)
{
    // 第一条实际指令: return sub_401960(arg1 - 0x5c) __tailcall
    return sub_401960(arg1 - 0x5c) __tailcall
}
