// ============================================================
// 函数名称: sub_4199c7
// 虚拟地址: 0x4199c7
// WARP GUID: 600b1f07-679d-5306-a319-f564584e84e6
// 源二进制: E:/torrent/Cursor/SkskShogi-1.022-win/SkskShogi.exe.bndb
// ------------------------------------------------------------
// [交叉引用字符串]: 无
// [外部 API 调用]: 无
// [内部子函数调用]: 无
// [被调用的父级函数]: 无
// ============================================================

int32_tsub_4199c7()
{
    // 第一条实际指令: if (data_42f958 != 0)
    if (data_42f958 != 0)
        return 0
    
    int32_t eax_1 = _calloc_crt(0x20, 4)
    int32_t eax_2 = EncodePointer(eax_1)
    data_42f958 = eax_2
    data_42f954 = eax_2
    
    if (eax_1 == 0)
        return 0x18
    
    *eax_1 = 0
    return 0
}
