// ============================================================
// 函数名称: sub_41a4e0
// 虚拟地址: 0x41a4e0
// WARP GUID: cf2f6347-791c-5ca8-863a-f94bdeb81d9a
// 源二进制: E:/torrent/Cursor/SkskShogi-1.022-win/SkskShogi.exe.bndb
// ------------------------------------------------------------
// [交叉引用字符串]: 无
// [外部 API 调用]: 无
// [内部子函数调用]: ??2@YAPAXIHPBDH@Z
// [被调用的父级函数]: 无
// ============================================================

int32_tsub_41a4e0(void* arg1 @ ebp)
{
    // 第一条实际指令: int32_t var_4 = 0x42cdc0
    int32_t var_4 = 0x42cdc0
    return operator new(*(arg1 - 0x10))
}
