// ============================================================
// 函数名称: sub_410f20
// 虚拟地址: 0x410f20
// WARP GUID: 71115395-70a3-5dab-95b3-47c7092f6cfd
// 源二进制: E:/torrent/Cursor/SkskShogi-1.022-win/SkskShogi.exe.bndb
// ------------------------------------------------------------
// [交叉引用字符串]: 无
// [外部 API 调用]: 无
// [内部子函数调用]: sub_410bb0
// [被调用的父级函数]: 无
// ============================================================

int32_t* __thiscallsub_410f20(void* arg1, int32_t* arg2)
{
    // 第一条实际指令: if (*arg2 != 6)
    if (*arg2 != 6)
        return arg2
    
    return sub_410bb0(*(arg1 + 4))
}
