// ============================================================
// 函数名称: sub_41c069
// 虚拟地址: 0x41c069
// WARP GUID: b4d727c2-7c33-5709-a0ef-6838de63f5c5
// 源二进制: E:/torrent/Cursor/SkskShogi-1.022-win/SkskShogi.exe.bndb
// ------------------------------------------------------------
// [交叉引用字符串]: 无
// [外部 API 调用]: __CxxFrameHandler3
// [内部子函数调用]: sub_4199b8
// [被调用的父级函数]: sub_4169c0
// ============================================================

voidsub_41c069(void* arg1) __noreturn
{
    // 第一条实际指令: sub_4199b8(*(arg1 - 0x198) ^ (arg1 - 0x194))
    sub_4199b8(*(arg1 - 0x198) ^ (arg1 - 0x194))
    sub_4199b8(*(arg1 - 8) ^ (arg1 - 0x188))
    noreturn __CxxFrameHandler3() __tailcall
}
