// ============================================================
// 函数名称: sub_416470
// 虚拟地址: 0x416470
// WARP GUID: ce42fbef-e389-5641-9489-0d8567b92281
// 源二进制: E:/torrent/Cursor/SkskShogi-1.022-win/SkskShogi.exe.bndb
// ------------------------------------------------------------
// [交叉引用字符串]: 无
// [外部 API 调用]: 无
// [内部子函数调用]: 无
// [被调用的父级函数]: 无
// ============================================================

void __fastcallsub_416470(void* arg1)
{
    // 第一条实际指令: void* esi = *(arg1 + 4)
    void* esi = *(arg1 + 4)
    int32_t* ecx = *(esi + 0x308)
    
    if (ecx != 0)
        (*(*ecx + 0x12c))(1)
        *(esi + 0x308) = 0
    
    *(esi + 0x2a4) = 0
}
