// ============================================================
// 函数名称: sub_4165a0
// 虚拟地址: 0x4165a0
// WARP GUID: c2a6056a-6058-55bd-b19e-c32759333063
// 源二进制: E:/torrent/Cursor/SkskShogi-1.022-win/SkskShogi.exe.bndb
// ------------------------------------------------------------
// [交叉引用字符串]: 无
// [外部 API 调用]: 无
// [内部子函数调用]: sub_415660
// [被调用的父级函数]: 无
// ============================================================

int32_t __fastcallsub_4165a0(void* arg1)
{
    // 第一条实际指令: return sub_415660(*(arg1 + 4)) __tailcall
    return sub_415660(*(arg1 + 4)) __tailcall
}
