// ============================================================
// 函数名称: sub_40e010
// 虚拟地址: 0x40e010
// WARP GUID: 50fe7e5c-2d4a-5286-ab5d-7a91768cbda5
// 源二进制: E:/torrent/Cursor/SkskShogi-1.022-win/SkskShogi.exe.bndb
// ------------------------------------------------------------
// [交叉引用字符串]: 无
// [外部 API 调用]: 无
// [内部子函数调用]: 无
// [被调用的父级函数]: 无
// ============================================================

void* __fastcallsub_40e010(void* arg1)
{
    // 第一条实际指令: (*(**(arg1 + 8) + 0xc))(7)
    (*(**(arg1 + 8) + 0xc))(7)
    int32_t* ecx_1 = *(arg1 + 8)
    int32_t* var_8 = ecx_1
    (*(*ecx_1 + 0xb4))(0x43340000)
    void* result = *(arg1 + 4)
    *(result + 0x2bc) -= 1
    return result
}
