// ============================================================
// 函数名称: sub_419aa3
// 虚拟地址: 0x419aa3
// WARP GUID: 6b22c743-92b9-5e8d-8a7f-ec3ea425d791
// 源二进制: E:/torrent/Cursor/SkskShogi-1.022-win/SkskShogi.exe.bndb
// ------------------------------------------------------------
// [交叉引用字符串]: 无
// [外部 API 调用]: _unlock
// [内部子函数调用]: 无
// [被调用的父级函数]: sub_419a03
// ============================================================

int32_tsub_419aa3()
{
    // 第一条实际指令: return _unlock(8)
    return _unlock(8)
}
