// ============================================================
// 函数名称: sub_40cf60
// 虚拟地址: 0x40cf60
// WARP GUID: 3e1a4db6-b11a-5dec-bfcf-3dc77593e7b9
// 源二进制: E:/torrent/Cursor/SkskShogi-1.022-win/SkskShogi.exe.bndb
// ------------------------------------------------------------
// [交叉引用字符串]: 无
// [外部 API 调用]: 无
// [内部子函数调用]: 无
// [被调用的父级函数]: sub_4169c0, sub_40adb0, sub_40f5f0, sub_411640, sub_409c90
// ============================================================

void __fastcallsub_40cf60(void* arg1)
{
    // 第一条实际指令: int32_t* ecx = *(arg1 + 0x10)
    int32_t* ecx = *(arg1 + 0x10)
    
    if (ecx != 0)
        (*(*ecx + 0x10))(ecx != arg1)
        *(arg1 + 0x10) = 0
    
    int32_t* ecx_1 = *(arg1 + 0x10)
    
    if (ecx_1 != 0)
        (*(*ecx_1 + 0x10))(ecx_1 != arg1)
        *(arg1 + 0x10) = 0
}
