// ============================================================
// 函数名称: sub_401ff0
// 虚拟地址: 0x401ff0
// WARP GUID: 1a01ee2d-e5eb-5b51-a670-f28ca2234350
// 源二进制: E:/torrent/Cursor/SkskShogi-1.022-win/SkskShogi.exe.bndb
// ------------------------------------------------------------
// [交叉引用字符串]: 无
// [外部 API 调用]: 无
// [内部子函数调用]: 无
// [被调用的父级函数]: sub_405f80
// ============================================================

void* __fastcallsub_401ff0(int32_t* arg1, char arg2)
{
    // 第一条实际指令: void* i
    void* i
    
    for (i = *arg1; i != arg1[1]; i += 2)
        if (*(i + 1) == arg2)
            i.b = 1
            return i
    
    i.b = 0
    return i
}
