// ============================================================
// 函数名称: sub_41a239
// 虚拟地址: 0x41a239
// WARP GUID: 3d5da113-5326-5877-924c-1bd4b17cf29d
// 源二进制: E:/torrent/Cursor/SkskShogi-1.022-win/SkskShogi.exe.bndb
// ------------------------------------------------------------
// [交叉引用字符串]: 无
// [外部 API 调用]: 无
// [内部子函数调用]: 无
// [被调用的父级函数]: 无
// ============================================================

int32_tsub_41a239(void* arg1 @ ebp)
{
    // 第一条实际指令: int32_t result
    int32_t result
    result.b = ***(arg1 - 0x14) == 0xc0000005
    return result
}
