// ============================================================
// 函数名称: sub_41a02f
// 虚拟地址: 0x41a02f
// WARP GUID: d4e3c2be-1936-5dda-b511-64b13f87d090
// 源二进制: E:/torrent/Cursor/SkskShogi-1.022-win/SkskShogi.exe.bndb
// ------------------------------------------------------------
// [交叉引用字符串]: 无
// [外部 API 调用]: 无
// [内部子函数调用]: $LN10
// [被调用的父级函数]: 无
// ============================================================

int32_tsub_41a02f(void* arg1 @ ebp)
{
    // 第一条实际指令: *(arg1 + 0xc)
    *(arg1 + 0xc)
    return $LN10(*(arg1 - 0x1c), arg1, *(arg1 + 8), *(arg1 + 0x10)) __tailcall
}
