// ============================================================
// 函数名称: sub_410d00
// 虚拟地址: 0x410d00
// WARP GUID: 2eeab8ec-1ab0-5246-b7c0-6bc493ad7cd2
// 源二进制: E:/torrent/Cursor/SkskShogi-1.022-win/SkskShogi.exe.bndb
// ------------------------------------------------------------
// [交叉引用字符串]: 无
// [外部 API 调用]: 无
// [内部子函数调用]: sub_410760
// [被调用的父级函数]: 无
// ============================================================

int32_t __fastcallsub_410d00(void* arg1)
{
    // 第一条实际指令: return sub_410760(arg1 + 4) __tailcall
    return sub_410760(arg1 + 4) __tailcall
}
