// ============================================================
// 函数名称: sub_408790
// 虚拟地址: 0x408790
// WARP GUID: 05f98494-e228-5b85-b7d9-9fc9f1fdb477
// 源二进制: E:/torrent/Cursor/SkskShogi-1.022-win/SkskShogi.exe.bndb
// ------------------------------------------------------------
// [交叉引用字符串]: 无
// [外部 API 调用]: 无
// [内部子函数调用]: 无
// [被调用的父级函数]: sub_40c770, sub_405d60
// ============================================================

void __fastcallsub_408790(void* arg1)
{
    // 第一条实际指令: int32_t* i = arg1 + 0x394
    for (int32_t* i = arg1 + 0x394; i != &i[0x19]; i = &i[1])
        int32_t* ecx = *i
        
        if (ecx != 0)
            (*(*ecx + 0x12c))(1)
            *i = 0
    
    *(arg1 + 0x2a5) = 0
}
