// ============================================================
// 函数名称: sub_401180
// 虚拟地址: 0x401180
// WARP GUID: 8b0caf77-a258-5ca2-bde4-531628803d7e
// 源二进制: E:/torrent/Cursor/SkskShogi-1.022-win/SkskShogi.exe.bndb
// ------------------------------------------------------------
// [交叉引用字符串]: 无
// [外部 API 调用]: 无
// [内部子函数调用]: _atexit, sub_40e320
// [被调用的父级函数]: 无
// ============================================================

int32_tsub_401180()
{
    // 第一条实际指令: int32_t* ecx
    int32_t* ecx
    sub_40e320(ecx)
    return _atexit(sub_41c400)
}
