// ============================================================
// 函数名称: sub_40e170
// 虚拟地址: 0x40e170
// WARP GUID: 501577d5-ee0c-51a7-bec2-84eca2a7a62b
// 源二进制: E:/torrent/Cursor/SkskShogi-1.022-win/SkskShogi.exe.bndb
// ------------------------------------------------------------
// [交叉引用字符串]: 无
// [外部 API 调用]: 无
// [内部子函数调用]: sub_40baa0
// [被调用的父级函数]: 无
// ============================================================

void __fastcallsub_40e170(void* arg1)
{
    // 第一条实际指令: int32_t* ecx = *(arg1 + 4)
    int32_t* ecx = *(arg1 + 4)
    
    if (ecx[0xb3] != 0)
        ecx[0xb3] = 0
        sub_40baa0(ecx)
}
