// ============================================================
// 函数名称: sub_40dbe0
// 虚拟地址: 0x40dbe0
// WARP GUID: 33dadbde-5873-5777-ab2d-4174f4cdf509
// 源二进制: E:/torrent/Cursor/SkskShogi-1.022-win/SkskShogi.exe.bndb
// ------------------------------------------------------------
// [交叉引用字符串]: 无
// [外部 API 调用]: 无
// [内部子函数调用]: sub_4087d0
// [被调用的父级函数]: 无
// ============================================================

int32_t* __thiscallsub_40dbe0(void* arg1, int32_t* arg2)
{
    // 第一条实际指令: if (*arg2 == 6)
    if (*arg2 == 6)
        int32_t* ecx = *(arg1 + 4)
        
        if (ecx[0xa9].b == 0)
            return sub_4087d0(ecx)
    
    return arg2
}
