// ============================================================
// 函数名称: sub_401d40
// 虚拟地址: 0x401d40
// WARP GUID: 7ce9025f-e98f-5971-9b7b-2a4829c892f5
// 源二进制: E:/torrent/Cursor/SkskShogi-1.022-win/SkskShogi.exe.bndb
// ------------------------------------------------------------
// [交叉引用字符串]: 无
// [外部 API 调用]: 无
// [内部子函数调用]: 无
// [被调用的父级函数]: sub_404680
// ============================================================

int32_t __stdcallsub_401d40(void* arg1)
{
    // 第一条实际指令: return operator delete(arg1)
    return operator delete(arg1)
}
