// ============================================================
// 函数名称: sub_40dab0
// 虚拟地址: 0x40dab0
// WARP GUID: 3c92d6e5-d1d0-5374-a820-4a9b7ae8cecb
// 源二进制: E:/torrent/Cursor/SkskShogi-1.022-win/SkskShogi.exe.bndb
// ------------------------------------------------------------
// [交叉引用字符串]: 无
// [外部 API 调用]: 无
// [内部子函数调用]: sub_405d60
// [被调用的父级函数]: 无
// ============================================================

int32_t __thiscallsub_40dab0(void* arg1, int32_t* arg2)
{
    // 第一条实际指令: void* var_8 = arg1
    void* var_8 = arg1
    return sub_405d60(arg1 + 4, *arg2)
}
