// ============================================================
// 函数名称: sub_40e250
// 虚拟地址: 0x40e250
// WARP GUID: 0f64a730-1da6-561a-8302-6813e012be39
// 源二进制: E:/torrent/Cursor/SkskShogi-1.022-win/SkskShogi.exe.bndb
// ------------------------------------------------------------
// [交叉引用字符串]: 无
// [外部 API 调用]: 无
// [内部子函数调用]: sub_40b730
// [被调用的父级函数]: 无
// ============================================================

int32_t __fastcallsub_40e250(void* arg1)
{
    // 第一条实际指令: return sub_40b730(*(arg1 + 4))
    return sub_40b730(*(arg1 + 4))
}
