// ============================================================
// 函数名称: sub_40d1d0
// 虚拟地址: 0x40d1d0
// WARP GUID: 9d8e3a25-ac3a-5a23-8d62-afee4519657e
// 源二进制: E:/torrent/Cursor/SkskShogi-1.022-win/SkskShogi.exe.bndb
// ------------------------------------------------------------
// [交叉引用字符串]: 无
// [外部 API 调用]: 无
// [内部子函数调用]: 无
// [被调用的父级函数]: 无
// ============================================================

void __fastcallsub_40d1d0(void* arg1)
{
    // 第一条实际指令: int32_t* ecx = *(arg1 + 0x10)
    int32_t* ecx = *(arg1 + 0x10)
    
    if (ecx != 0)
        (*(*ecx + 0x10))(ecx != arg1)
        *(arg1 + 0x10) = 0
}
