// ============================================================
// 函数名称: sub_41b8d4
// 虚拟地址: 0x41b8d4
// WARP GUID: dd9389f1-ebd6-5334-84ff-9060504e5207
// 源二进制: E:/torrent/Cursor/SkskShogi-1.022-win/SkskShogi.exe.bndb
// ------------------------------------------------------------
// [交叉引用字符串]: 无
// [外部 API 调用]: __CxxFrameHandler3
// [内部子函数调用]: sub_4199b8
// [被调用的父级函数]: sub_411640
// ============================================================

voidsub_41b8d4(void* arg1) __noreturn
{
    // 第一条实际指令: sub_4199b8(*(arg1 - 0x168) ^ (arg1 - 0x164))
    sub_4199b8(*(arg1 - 0x168) ^ (arg1 - 0x164))
    sub_4199b8(*(arg1 - 8) ^ (arg1 - 0x158))
    noreturn __CxxFrameHandler3() __tailcall
}
