// ============================================================
// 函数名称: sub_41b934
// 虚拟地址: 0x41b934
// WARP GUID: afa732f9-0304-5ffe-bc01-945b8633bbb6
// 源二进制: E:/torrent/Cursor/SkskShogi-1.022-win/SkskShogi.exe.bndb
// ------------------------------------------------------------
// [交叉引用字符串]: 无
// [外部 API 调用]: __CxxFrameHandler3
// [内部子函数调用]: sub_4199b8
// [被调用的父级函数]: sub_413540
// ============================================================

voidsub_41b934(void* arg1) __noreturn
{
    // 第一条实际指令: sub_4199b8(*(arg1 - 0x38) ^ (arg1 - 0x34))
    sub_4199b8(*(arg1 - 0x38) ^ (arg1 - 0x34))
    noreturn __CxxFrameHandler3() __tailcall
}
