// ============================================================
// 函数名称: sub_40d8c0
// 虚拟地址: 0x40d8c0
// WARP GUID: 606e3054-7a39-55a3-bd6d-c0680c63c4fb
// 源二进制: E:/torrent/Cursor/SkskShogi-1.022-win/SkskShogi.exe.bndb
// ------------------------------------------------------------
// [交叉引用字符串]: 无
// [外部 API 调用]: 无
// [内部子函数调用]: 无
// [被调用的父级函数]: 无
// ============================================================

int32_t __fastcallsub_40d8c0(int32_t arg1) __pure
{
    // 第一条实际指令: return arg1 + 4
    return arg1 + 4
}
