// ============================================================
// 函数名称: sub_40d790
// 虚拟地址: 0x40d790
// WARP GUID: d3d0f16d-18e8-57ab-8bcf-5ea23675af65
// 源二进制: E:/torrent/Cursor/SkskShogi-1.022-win/SkskShogi.exe.bndb
// ------------------------------------------------------------
// [交叉引用字符串]: 无
// [外部 API 调用]: 无
// [内部子函数调用]: 无
// [被调用的父级函数]: sub_40cfa0
// ============================================================

int32_t __fastcallsub_40d790(int16_t* arg1, int32_t arg2)
{
    // 第一条实际指令: if (arg2 == 0)
    if (arg2 == 0)
        return 
    
    int32_t i
    
    do
        if (arg1 != 0)
            *arg1 = 0
        
        arg1 = &arg1[1]
        i = arg2
        arg2 -= 1
    while (i != 1)
}
