// ============================================================
// 函数名称: sub_419b47
// 虚拟地址: 0x419b47
// WARP GUID: df320ead-c88c-5d16-a998-b40903c84632
// 源二进制: E:/torrent/Cursor/SkskShogi-1.022-win/SkskShogi.exe.bndb
// ------------------------------------------------------------
// [交叉引用字符串]: 无
// [外部 API 调用]: 无
// [内部子函数调用]: 无
// [被调用的父级函数]: 无
// ============================================================

int32_tsub_419b47(void* arg1 @ ebp)
{
    // 第一条实际指令: *(arg1 - 0x14) = 0
    *(arg1 - 0x14) = 0
    return 0x419b51
}
