// ============================================================
// 函数名称: sub_40de20
// 虚拟地址: 0x40de20
// WARP GUID: 76b037d4-82e0-53ee-bd29-bc6c8e5c2511
// 源二进制: E:/torrent/Cursor/SkskShogi-1.022-win/SkskShogi.exe.bndb
// ------------------------------------------------------------
// [交叉引用字符串]: 无
// [外部 API 调用]: 无
// [内部子函数调用]: 无
// [被调用的父级函数]: 无
// ============================================================

void* __fastcallsub_40de20(void* arg1)
{
    // 第一条实际指令: (*(**(arg1 + 8) + 0xc))(7)
    (*(**(arg1 + 8) + 0xc))(7)
    void* result = *(arg1 + 4)
    *(result + 0x2bc) = 0
    return result
}
