// ============================================================
// 函数名称: sub_416540
// 虚拟地址: 0x416540
// WARP GUID: eee5fbb7-166c-5a3d-913b-adeb754a5fd9
// 源二进制: E:/torrent/Cursor/SkskShogi-1.022-win/SkskShogi.exe.bndb
// ------------------------------------------------------------
// [交叉引用字符串]: 无
// [外部 API 调用]: 无
// [内部子函数调用]: sub_415470
// [被调用的父级函数]: 无
// ============================================================

HINSTANCEsub_416540()
{
    // 第一条实际指令: return sub_415470()
    return sub_415470()
}
