// ============================================================
// 函数名称: sub_40d7b0
// 虚拟地址: 0x40d7b0
// WARP GUID: 9d517043-7d3a-5f52-aa5c-a2d41551244d
// 源二进制: E:/torrent/Cursor/SkskShogi-1.022-win/SkskShogi.exe.bndb
// ------------------------------------------------------------
// [交叉引用字符串]: 无
// [外部 API 调用]: 无
// [内部子函数调用]: sub_402090
// [被调用的父级函数]: sub_40d010
// ============================================================

void __fastcallsub_40d7b0(char* arg1, int32_t arg2)
{
    // 第一条实际指令: int32_t i_1 = arg2
    int32_t i_1 = arg2
    
    if (i_1 == 0)
        return 
    
    int32_t i
    
    do
        if (arg1 != 0)
            sub_402090(arg1)
        
        arg1 = &arg1[0x21]
        i = i_1
        i_1 -= 1
    while (i != 1)
}
