// ============================================================
// 函数名称: sub_41a736
// 虚拟地址: 0x41a736
// WARP GUID: 3a0b07f6-48b0-5160-9f6a-3b7bbb1ffd16
// 源二进制: E:/torrent/Cursor/SkskShogi-1.022-win/SkskShogi.exe.bndb
// ------------------------------------------------------------
// [交叉引用字符串]: 无
// [外部 API 调用]: __CxxFrameHandler3
// [内部子函数调用]: sub_4199b8
// [被调用的父级函数]: sub_404680
// ============================================================

voidsub_41a736(void* arg1) __noreturn
{
    // 第一条实际指令: sub_4199b8(*(arg1 - 0x118) ^ (arg1 - 0x114))
    sub_4199b8(*(arg1 - 0x118) ^ (arg1 - 0x114))
    sub_4199b8(*(arg1 - 8) ^ (arg1 - 0x108))
    noreturn __CxxFrameHandler3() __tailcall
}
