// ============================================================
// 函数名称: sub_418d20
// 虚拟地址: 0x418d20
// WARP GUID: 2ccccd51-a190-5397-9fc3-b7ef4a5ad612
// 源二进制: E:/torrent/Cursor/SkskShogi-1.022-win/SkskShogi.exe.bndb
// ------------------------------------------------------------
// [交叉引用字符串]: 无
// [外部 API 调用]: 无
// [内部子函数调用]: 无
// [被调用的父级函数]: 无
// ============================================================

void __fastcallsub_418d20(void* arg1)
{
    // 第一条实际指令: void* esi = *(arg1 + 4)
    void* esi = *(arg1 + 4)
    int32_t* ecx = *(esi + 0x2a4)
    *(esi + 0x2a0) = 0
    
    if (ecx != 0)
        (*(*ecx + 0x12c))(1)
        *(esi + 0x2a4) = 0
}
