// ============================================================
// 函数名称: sub_410d60
// 虚拟地址: 0x410d60
// WARP GUID: 09ccba73-3f2c-5f31-b79a-7949094efe96
// 源二进制: E:/torrent/Cursor/SkskShogi-1.022-win/SkskShogi.exe.bndb
// ------------------------------------------------------------
// [交叉引用字符串]: 无
// [外部 API 调用]: 无
// [内部子函数调用]: sub_410810
// [被调用的父级函数]: 无
// ============================================================

int32_t __fastcallsub_410d60(void* arg1)
{
    // 第一条实际指令: return sub_410810(arg1 + 4) __tailcall
    return sub_410810(arg1 + 4) __tailcall
}
