// ============================================================
// 函数名称: sub_41a33d
// 虚拟地址: 0x41a33d
// WARP GUID: eb064d63-6628-521b-aca2-390e81f3c00b
// 源二进制: E:/torrent/Cursor/SkskShogi-1.022-win/SkskShogi.exe.bndb
// ------------------------------------------------------------
// [交叉引用字符串]: 无
// [外部 API 调用]: 无
// [内部子函数调用]: 无
// [被调用的父级函数]: _pre_c_init
// ============================================================

int32_tsub_41a33d() __pure
{
    // 第一条实际指令: return 0
    return 0
}
