// ============================================================
// 函数名称: sub_410e60
// 虚拟地址: 0x410e60
// WARP GUID: 80e888b5-4d1d-5d5d-8547-06e299586e1c
// 源二进制: E:/torrent/Cursor/SkskShogi-1.022-win/SkskShogi.exe.bndb
// ------------------------------------------------------------
// [交叉引用字符串]: 无
// [外部 API 调用]: 无
// [内部子函数调用]: sub_4108c0
// [被调用的父级函数]: 无
// ============================================================

int32_t __fastcallsub_410e60(void* arg1)
{
    // 第一条实际指令: return sub_4108c0(arg1 + 4) __tailcall
    return sub_4108c0(arg1 + 4) __tailcall
}
