// ============================================================
// 函数名称: sub_4011e0
// 虚拟地址: 0x4011e0
// WARP GUID: 2d38644a-8649-57eb-961a-d7ff0d8acf82
// 源二进制: E:/torrent/Cursor/SkskShogi-1.022-win/SkskShogi.exe.bndb
// ------------------------------------------------------------
// [交叉引用字符串]: 无
// [外部 API 调用]: 无
// [内部子函数调用]: _atexit
// [被调用的父级函数]: 无
// ============================================================

int32_tsub_4011e0()
{
    // 第一条实际指令: return _atexit(sub_41c450)
    return _atexit(sub_41c450)
}
