// ============================================================
// 函数名称: sub_401960
// 虚拟地址: 0x401960
// WARP GUID: d402a348-304b-5920-8556-0b99928731ff
// 源二进制: E:/torrent/Cursor/SkskShogi-1.022-win/SkskShogi.exe.bndb
// ------------------------------------------------------------
// [交叉引用字符串]: 无
// [外部 API 调用]: 无
// [内部子函数调用]: 无
// [被调用的父级函数]: sub_40b490, sub_40f5f0, sub_40c770, sub_41a400, sub_413640, sub_409c90, sub_4087d0
// ============================================================

void __fastcallsub_401960(int32_t* arg1)
{
    // 第一条实际指令: if (arg1[5] u>= 0x10)
    if (arg1[5] u>= 0x10)
        operator delete(*arg1)
    
    arg1[5] = 0xf
    arg1[4] = 0
    *arg1 = 0
}
