// ============================================================
// 函数名称: sub_40d140
// 虚拟地址: 0x40d140
// WARP GUID: 5ba6b9af-aa60-5d29-98f8-b8e2a28ee14a
// 源二进制: E:/torrent/Cursor/SkskShogi-1.022-win/SkskShogi.exe.bndb
// ------------------------------------------------------------
// [交叉引用字符串]: 无
// [外部 API 调用]: 无
// [内部子函数调用]: 无
// [被调用的父级函数]: sub_41c400
// ============================================================

int32_tsub_40d140() __pure
{
    // 第一条实际指令: return 
    return 
}
